balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1824.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR1H" edc:desc="" edc:mask="0xff" edc:name="CCPR1H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1M0" edc:desc="" edc:mask="0x1" edc:name="CCP1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M1" edc:desc="" edc:mask="0x1" edc:name="CCP1M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M2" edc:desc="" edc:mask="0x1" edc:name="CCP1M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M3" edc:desc="" edc:mask="0x1" edc:name="CCP1M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B0" edc:desc="" edc:mask="0x1" edc:name="DC1B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B1" edc:desc="" edc:mask="0x1" edc:name="DC1B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M0" edc:desc="" edc:mask="0x1" edc:name="P1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M1" edc:desc="" edc:mask="0x1" edc:name="P1M1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1M" edc:desc="" edc:mask="0xf" edc:name="CCP1M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC1B" edc:desc="" edc:mask="0x3" edc:name="DC1B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P1M" edc:desc="" edc:mask="0x3" edc:name="P1M" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1DC0" edc:desc="" edc:mask="0x1" edc:name="P1DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC1" edc:desc="" edc:mask="0x1" edc:name="P1DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC2" edc:desc="" edc:mask="0x1" edc:name="P1DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC3" edc:desc="" edc:mask="0x1" edc:name="P1DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC4" edc:desc="" edc:mask="0x1" edc:name="P1DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC5" edc:desc="" edc:mask="0x1" edc:name="P1DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DC6" edc:desc="" edc:mask="0x1" edc:name="P1DC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1RSEN" edc:desc="" edc:mask="0x1" edc:name="P1RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P1DC" edc:desc="" edc:mask="0x7f" edc:name="P1DC" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1AS" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="ECCP1AS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS1BD0" edc:desc="" edc:mask="0x1" edc:name="PSS1BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1BD1" edc:desc="" edc:mask="0x1" edc:name="PSS1BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC0" edc:desc="" edc:mask="0x1" edc:name="PSS1AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC1" edc:desc="" edc:mask="0x1" edc:name="PSS1AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS0" edc:desc="" edc:mask="0x1" edc:name="CCP1AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS1" edc:desc="" edc:mask="0x1" edc:name="CCP1AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS2" edc:desc="" edc:mask="0x1" edc:name="CCP1AS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1ASE" edc:desc="" edc:mask="0x1" edc:name="CCP1ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS1BD" edc:desc="" edc:mask="0x3" edc:name="PSS1BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS1AC" edc:desc="" edc:mask="0x3" edc:name="PSS1AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP1AS" edc:desc="" edc:mask="0x7" edc:name="CCP1AS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR1CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR1CON" edc:nzwidth="8" edc:por="---00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR1A" edc:desc="" edc:mask="0x1" edc:name="STR1A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1B" edc:desc="" edc:mask="0x1" edc:name="STR1B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1C" edc:desc="" edc:mask="0x1" edc:name="STR1C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1D" edc:desc="" edc:mask="0x1" edc:name="STR1D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR1SYNC" edc:desc="" edc:mask="0x1" edc:name="STR1SYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR2L" edc:desc="" edc:mask="0xff" edc:name="CCPR2L" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2RH" edc:desc="" edc:mask="0xff" edc:name="CCP2RH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2M0" edc:desc="" edc:mask="0x1" edc:name="CCP2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M1" edc:desc="" edc:mask="0x1" edc:name="CCP2M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M2" edc:desc="" edc:mask="0x1" edc:name="CCP2M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2M3" edc:desc="" edc:mask="0x1" edc:name="CCP2M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B0" edc:desc="" edc:mask="0x1" edc:name="DC2B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC2B1" edc:desc="" edc:mask="0x1" edc:name="DC2B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M0" edc:desc="" edc:mask="0x1" edc:name="P2M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2M1" edc:desc="" edc:mask="0x1" edc:name="P2M1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2M" edc:desc="" edc:mask="0xf" edc:name="CCP2M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC2B" edc:desc="" edc:mask="0x3" edc:name="DC2B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P2M" edc:desc="" edc:mask="0x3" edc:name="P2M" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM2CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P2DC0" edc:desc="" edc:mask="0x1" edc:name="P2DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC1" edc:desc="" edc:mask="0x1" edc:name="P2DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC2" edc:desc="" edc:mask="0x1" edc:name="P2DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC3" edc:desc="" edc:mask="0x1" edc:name="P2DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC4" edc:desc="" edc:mask="0x1" edc:name="P2DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC5" edc:desc="" edc:mask="0x1" edc:name="P2DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DC6" edc:desc="" edc:mask="0x1" edc:name="P2DC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2RSEN" edc:desc="" edc:mask="0x1" edc:name="P2RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P2DC" edc:desc="" edc:mask="0x7f" edc:name="P2DC" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP2AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP2AS" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS2BD0" edc:desc="" edc:mask="0x1" edc:name="PSS2BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2BD1" edc:desc="" edc:mask="0x1" edc:name="PSS2BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC0" edc:desc="" edc:mask="0x1" edc:name="PSS2AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS2AC1" edc:desc="" edc:mask="0x1" edc:name="PSS2AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS0" edc:desc="" edc:mask="0x1" edc:name="CCP2AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS1" edc:desc="" edc:mask="0x1" edc:name="CCP2AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2AS2" edc:desc="" edc:mask="0x1" edc:name="CCP2AS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2ASE" edc:desc="" edc:mask="0x1" edc:name="CCP2ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS2BD" edc:desc="" edc:mask="0x3" edc:name="PSS2BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS2AC" edc:desc="" edc:mask="0x3" edc:name="PSS2AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP2AS" edc:desc="" edc:mask="0x7" edc:name="CCP2AS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR2CON" edc:nzwidth="8" edc:por="---00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR2A" edc:desc="" edc:mask="0x1" edc:name="STR2A" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2B" edc:desc="" edc:mask="0x1" edc:name="STR2B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2C" edc:desc="" edc:mask="0x1" edc:name="STR2C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2D" edc:desc="" edc:mask="0x1" edc:name="STR2D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STR2SYNC" edc:desc="" edc:mask="0x1" edc:name="STR2SYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCPTMRS0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CCPTMRS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:desc="" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:desc="" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:desc="" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:desc="" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL0" edc:desc="" edc:mask="0x1" edc:name="C3TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3TSEL1" edc:desc="" edc:mask="0x1" edc:name="C3TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL0" edc:desc="" edc:mask="0x1" edc:name="C4TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4TSEL1" edc:desc="" edc:mask="0x1" edc:name="C4TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:desc="" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:desc="" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C3TSEL" edc:desc="" edc:mask="0x3" edc:name="C3TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C4TSEL" edc:desc="" edc:mask="0x3" edc:name="C4TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR3L" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR3L" edc:desc="" edc:mask="0xff" edc:name="CCPR3L" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR3H" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR3H" edc:desc="" edc:mask="0xff" edc:name="CCPR3H" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
